//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ИмеетсяДокументПоступление()","ИмеетсяДокументПоступление","Дано Имеется документ Поступление");
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюДокумент(Парам01)","ЯОткрываюДокумент","Когда Я открываю документ ""Поступление Товара"""); //уже был в D:\BDD\RepositoryLection4\Features\Drafts\step_definitions\ОткрытиеДокумента.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НаЭкранеПоявляетсяФормаВыбранногоДокумента()","НаЭкранеПоявляетсяФормаВыбранногоДокумента","Тогда На экране появляется форма выбранного документа"); //уже был в D:\BDD\RepositoryLection4\Features\Drafts\step_definitions\ОткрытиеДокумента.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаКнопку(Парам01)","ЯНажимаюНаКнопку","Когда Я нажимаю на кнопку ""Заполнение количества поступления"""); //уже был в D:\Степашкин\Обучение BDD\vanessa-behavior\features\Libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПоявляетсяОкноВводаЖелаемогоКоличества()","ПоявляетсяОкноВводаЖелаемогоКоличества","Тогда появляется окно ввода желаемого количества");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВвожуЖелаемоеКоличество()","ЯВвожуЖелаемоеКоличество","Когда я ввожу желаемое количество");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НажимаюКнопкуОк()","НажимаюКнопкуОк","И Нажимаю кнопку Ок");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПроисхоитЗаполнениеКолонкиДляКаждойСтрокиТаблицыВыбраннымЗначением(Парам01,Парам02)","ПроисхоитЗаполнениеКолонкиДляКаждойСтрокиТаблицыВыбраннымЗначением","Тогда происхоит заполнение колонки ""Количество к поступлению"" для каждой строки таблицы ""Товары"" выбранным значением");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано Имеется документ Поступление
//@ИмеетсяДокументПоступление()
Процедура ИмеетсяДокументПоступление() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить("Найден документ - Поступление товаров");
КонецПроцедуры

//&НаКлиенте
////Когда Я открываю документ "Поступление Товара"
////@ЯОткрываюДокумент(Парам01)
//Процедура ЯОткрываюДокумент(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Тогда На экране появляется форма выбранного документа
////@НаЭкранеПоявляетсяФормаВыбранногоДокумента()
//Процедура НаЭкранеПоявляетсяФормаВыбранногоДокумента() Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Когда Я нажимаю на кнопку "Заполнение количества поступления"
////@ЯНажимаюНаКнопку(Парам01)
//Процедура ЯНажимаюНаКнопку(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

&НаКлиенте
//Тогда появляется окно ввода желаемого количества
//@ПоявляетсяОкноВводаЖелаемогоКоличества()
Процедура ПоявляетсяОкноВводаЖелаемогоКоличества() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда я ввожу желаемое количество
//@ЯВвожуЖелаемоеКоличество()
Процедура ЯВвожуЖелаемоеКоличество() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И Нажимаю кнопку Ок
//@НажимаюКнопкуОк()
Процедура НажимаюКнопкуОк() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда происхоит заполнение колонки "Количество к поступлению" для каждой строки таблицы "Товары" выбранным значением
//@ПроисхоитЗаполнениеКолонкиДляКаждойСтрокиТаблицыВыбраннымЗначением(Парам01,Парам02)
Процедура ПроисхоитЗаполнениеКолонкиДляКаждойСтрокиТаблицыВыбраннымЗначением(Парам01,Парам02) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля