//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ИмеетсяЛюбойДокумент()","ИмеетсяЛюбойДокумент","Дано Имеется любой документ");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюДокумент(Парам01)","ЯОткрываюДокумент","Когда Я открываю документ ""Поступление Товара""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НаЭкранеПоявляетсяФормаВыбранногоДокумента()","НаЭкранеПоявляетсяФормаВыбранногоДокумента","Тогда На экране появляется форма выбранного документа");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано Имеется любой документ
//@ИмеетсяЛюбойДокумент()
Процедура ИмеетсяЛюбойДокумент() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Я открываю документ "Поступление Товара"
//@ЯОткрываюДокумент(Парам01)
Процедура ЯОткрываюДокумент(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить("Открыт документ " + Строка(Парам01));
КонецПроцедуры

&НаКлиенте
//Тогда На экране появляется форма выбранного документа
//@НаЭкранеПоявляетсяФормаВыбранногоДокумента()
Процедура НаЭкранеПоявляетсяФормаВыбранногоДокумента() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить("Открыта форма выбранного документа");
КонецПроцедуры

//окончание текста модуля